app/Http/Controllers/AdminController.php

    public function index()
    {
        return view('admin.index', [
            'setting' => Admin::orderBy('id', 'desc')->first(),
        ]);
---
select * from `admins` order by `id` desc limit 1

    public function store(AdminRequest $request)
    {
        Admin::create($request->toData());
---
insert into `admins` (`netto_price`, `bag_packing_cost_price`, `bigbag_packing_cost_price`, `loose_packing_cost_price`, `updated_at`, `created_at`) values ('', '', '', '', '2023-02-28 15:19:46', '2023-02-28 15:19:46')