app/Http/Controllers/ClientController.php

select * from `clients`
select * from `orders` where `orders`.`client_id` in (1, 2)
---
    public function index()
    {
        return view('client.index', [
            'clients' => Client::with('orders')->get()
        ]);

insert into `clients` (`name`, `lastname`, `city`, `status`, `updated_at`, `created_at`) values ('fdsf', 'fdsfds', 'dfsfsd', '1', '2023-02-28 13:05:56', '2023-02-28 13:05:56')
---
    public function store()
    {
        $attributes = request()->validate([
            'name' => ['min:3'],
            'lastname' => ['min:3'],
            'city' => ['required'],
            'status' => ['min:1'],
        ]);
        Client::create($attributes);