app/Http/Controllers/OrderController.php

select * from `clients` where `clients`.`id` in (1)
select * from `orders`
---
    public function index()
    {
        return view('order.index',[
            'orders' => Order::with('clients')->get(),
            'typeOfOrders' => Order::with('typeOfOrders')->get()
        ]);

select * from `clients`
---
    public function create()
    {
        return view('order.create',[
            'clients' => Client::all(),
            'typeOfOrders' => TypeOfOrder::all()
            ]);

insert into `orders` (`client_id`, `price`, `quantity`, `order_type`, `deadline`, `updated_at`, `created_at`) values ('1', 11880, '99', 'bag', '2023-02-28 13:06:05', '2023-02-28 13:06:09', '2023-02-28 13:06:09')
---
    public function store()
    {
        $attributes = $this->validateOrder();

        Order::create($attributes);